docs/site/masone16_contem_bassoon.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-21 Sat 11:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>masone16_contem_bassoon</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="../style.css" type="text/css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">masone16_contem_bassoon</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb50d246">The contemporary bassoonist: music for interactive electroacoustics and bassoon</a>
<ul>
<li><a href="#org2d82ac7">Familiarity&#xa0;&#xa0;&#xa0;<span class="tag"><span class="difficulty">difficulty</span></span></a></li>
<li><a href="#orgba58a4d">Contemporary</a></li>
<li><a href="#org3cbd053">Performance Practice&#xa0;&#xa0;&#xa0;<span class="tag"><span class="pp">pp</span></span></a></li>
<li><a href="#org50206f0">Composer Performer Interaction</a></li>
<li><a href="#org8f25193">History&#xa0;&#xa0;&#xa0;<span class="tag"><span class="history">history</span></span></a></li>
<li><a href="#orga0c80a0">Interactive</a></li>
<li><a href="#orgac5dcbb">Problems&#xa0;&#xa0;&#xa0;<span class="tag"><span class="difficulty">difficulty</span></span></a></li>
<li><a href="#org87a98e9">FIxed Media&#xa0;&#xa0;&#xa0;<span class="tag"><span class="difficulty">difficulty</span></span></a></li>
<li><a href="#org7a402a1">Techinician&#xa0;&#xa0;&#xa0;<span class="tag"><span class="setup">setup</span></span></a></li>
<li><a href="#org6d673d7">Programming</a></li>
<li><a href="#orgd561e96">Usability</a></li>
<li><a href="#org47a5d6f">Difference&#xa0;&#xa0;&#xa0;<span class="tag"><span class="setup">setup</span>&#xa0;<span class="quote">quote</span></span></a></li>
<li><a href="#org86ecb9c">Practice with tech&#xa0;&#xa0;&#xa0;<span class="tag"><span class="difficulty">difficulty</span>&#xa0;<span class="tech">tech</span></span></a></li>
<li><a href="#org70e665e">Amplification&#xa0;&#xa0;&#xa0;<span class="tag"><span class="amp">amp</span></span></a></li>
<li><a href="#org047e662">Microphones&#xa0;&#xa0;&#xa0;<span class="tag"><span class="amp">amp</span></span></a></li>
<li><a href="#org42643d7">Sitting or standing&#xa0;&#xa0;&#xa0;<span class="tag"><span class="difficulty">difficulty</span></span></a></li>
<li><a href="#org0d99a00">Responsibility&#xa0;&#xa0;&#xa0;<span class="tag"><span class="quote">quote</span></span></a></li>
<li><a href="#org452169a">Co composer</a></li>
<li><a href="#org1c4c4d8">Pitch Tracking&#xa0;&#xa0;&#xa0;<span class="tag"><span class="difficulty">difficulty</span></span></a></li>
<li><a href="#org9da9035">Score Following</a></li>
<li><a href="#orgc4675c4">Sand Daemon</a></li>
<li><a href="#org92b9abc">Technicians</a></li>
<li><a href="#orgfff43a5">Benefit of Live Composers</a></li>
<li><a href="#org3f42ead">composer interviews</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgb50d246" class="outline-2">
<h2 id="orgb50d246">The contemporary bassoonist: music for interactive electroacoustics and bassoon</h2>
<div class="outline-text-2" id="text-orgb50d246">
</div>
<div id="outline-container-org2d82ac7" class="outline-3">
<h3 id="org2d82ac7">Familiarity&#xa0;&#xa0;&#xa0;<span class="tag"><span class="difficulty">difficulty</span></span></h3>
<div class="outline-text-3" id="text-org2d82ac7">
<p>
Much of the music is unknown to bassoonists and is intimidating.
</p>
</div>
</div>
<div id="outline-container-orgba58a4d" class="outline-3">
<h3 id="orgba58a4d">Contemporary</h3>
<div class="outline-text-3" id="text-orgba58a4d">
<p>
If half the composers of "contemporary" bassoon music are dead, why do we still call it "contemporary"?
</p>
</div>
</div>
<div id="outline-container-org3cbd053" class="outline-3">
<h3 id="org3cbd053">Performance Practice&#xa0;&#xa0;&#xa0;<span class="tag"><span class="pp">pp</span></span></h3>
<div class="outline-text-3" id="text-org3cbd053">
<p>
Performance practice mostly deals with the score, but in electroacoustic music it needs to go beyond that, and include the music, amplification, computers, hardware, etc.
</p>
</div>
</div>
<div id="outline-container-org50206f0" class="outline-3">
<h3 id="org50206f0">Composer Performer Interaction</h3>
<div class="outline-text-3" id="text-org50206f0">
<p>
Most works written for bassoon and interactive electronics are because of collaborations between the performer and the composer
</p>
</div>
</div>
<div id="outline-container-org8f25193" class="outline-3">
<h3 id="org8f25193">History&#xa0;&#xa0;&#xa0;<span class="tag"><span class="history">history</span></span></h3>
<div class="outline-text-3" id="text-org8f25193">
<p>
Most started after WWII in Europe with magnetic tape recording. The first modern recording studio was in France in 1951 with the <i>Groupe de Recherche de Musique Concrete</i>. Boulez, Stockhausen, and Messiaen started here.
</p>

<p>
Synthesizers became more prominent, and Milton Babbitt and others started the Columbia-Princeton Electronic Music Center and had its first concerts by 1961.
</p>

<p>
First bassoon and electroacoustic works were in the early 1970s. <i>Aria No. 4</i> by Elliot Schwarts in 1972. Earliest for solo bassoon and tape. Miklos Maros <i>Manipulations No. 1</i> was for bassoon and Svenson-Box in 1976. Possibly earliest bassoon and interactive electronics piece. Paul-Heinz Dittrich's <i>the-m for bassoon and live-electronics</i> in 1982-3. Tech was limited to tape delay systems, ring modulators, contact microphones, and effect modules of tremolo, reverb, and phasing. A piece like <i>the-m</i> can be simulated using something like Max/MSP. <i>The-m</i> was done in 2011 this way.
</p>

<p>
The 1980s had lots of newer works. <i>Alba</i> by Richard Barrett is probably the most significant. It is now unplayable because of obsolete technology. Many bassoon and electronics pieces are just amplified bassoon, like Stockhausen's <i>Fagott</i> in 1995.
</p>

<p>
IRCAM has some of the most complex bassoon and electronics pieces.
</p>
</div>
</div>
<div id="outline-container-orga0c80a0" class="outline-3">
<h3 id="orga0c80a0">Interactive</h3>
<div class="outline-text-3" id="text-orga0c80a0">
<p>
Some scholars would say triggering fixed media with a pedal is not interactive. It has to interpret the signal and playback something based on that.
</p>
</div>
</div>
<div id="outline-container-orgac5dcbb" class="outline-3">
<h3 id="orgac5dcbb">Problems&#xa0;&#xa0;&#xa0;<span class="tag"><span class="difficulty">difficulty</span></span></h3>
<div class="outline-text-3" id="text-orgac5dcbb">
<p>
Exposure. Professors aren't introducing this music to their students. Professors are often the main source of repertoire for their students.
</p>

<p>
Music. The music can be the most difficult in the repertoire. 
</p>
</div>
</div>
<div id="outline-container-org87a98e9" class="outline-3">
<h3 id="org87a98e9">FIxed Media&#xa0;&#xa0;&#xa0;<span class="tag"><span class="difficulty">difficulty</span></span></h3>
<div class="outline-text-3" id="text-org87a98e9">
<p>
McNutt quotes. Fixed Media is the worst accompanist possible.
</p>

<p>
Pestova's quote "It is important to note that live electronics differ from fixed media by giving the composer and the performer an opportunity to escape the potential rigidity of strict synchronization, and to have the electronic as well as instrumental parts of the piece sound different in every performance."
</p>
</div>
</div>
<div id="outline-container-org7a402a1" class="outline-3">
<h3 id="org7a402a1">Techinician&#xa0;&#xa0;&#xa0;<span class="tag"><span class="setup">setup</span></span></h3>
<div class="outline-text-3" id="text-org7a402a1">
<p>
A nice analogy of the reed to the bassoon being like the performer and the hardware. Either one can be at fault. We need to know our side of things well so that we can fix our problems.
</p>
</div>
</div>
<div id="outline-container-org6d673d7" class="outline-3">
<h3 id="org6d673d7">Programming</h3>
<div class="outline-text-3" id="text-org6d673d7">
<p>
It is not necessary to know how to design patches to perform these works.
Having a basic understanding of how a patch looks and operates can be useful.
</p>
</div>
</div>
<div id="outline-container-orgd561e96" class="outline-3">
<h3 id="orgd561e96">Usability</h3>
<div class="outline-text-3" id="text-orgd561e96">
<p>
Most composers make their patches as user friendly as possible. Just a couple of mouse clicks.
</p>
</div>
</div>
<div id="outline-container-org47a5d6f" class="outline-3">
<h3 id="org47a5d6f">Difference&#xa0;&#xa0;&#xa0;<span class="tag"><span class="setup">setup</span>&#xa0;<span class="quote">quote</span></span></h3>
<div class="outline-text-3" id="text-org47a5d6f">
<p>
"Because Max/MSP is able to do so many things, and each patch is individualized, every patch will look different from another, especially from composer to composer." good quote to justify the bibliography section
</p>
</div>
</div>
<div id="outline-container-org86ecb9c" class="outline-3">
<h3 id="org86ecb9c">Practice with tech&#xa0;&#xa0;&#xa0;<span class="tag"><span class="difficulty">difficulty</span>&#xa0;<span class="tech">tech</span></span></h3>
<div class="outline-text-3" id="text-org86ecb9c">
<p>
Solution is lots of practice with the technology. It's like rehearsing with another person in chamber music. You will have more experience of what can go wrong and how to fix it.
</p>

<p>
Nathan Davis quote
"Some performers don't realize how much they must practice with their electronics and get to know them - or think they can just learn their part and means they have learned the piece. A piece with live electronics should be chamber music. This never comes up with those who commission my pieces, but it sometimes does as the pieces go out into the world." 
</p>
</div>
</div>
<div id="outline-container-org70e665e" class="outline-3">
<h3 id="org70e665e">Amplification&#xa0;&#xa0;&#xa0;<span class="tag"><span class="amp">amp</span></span></h3>
<div class="outline-text-3" id="text-org70e665e">
<p>
Amplification will always be a challenge because of the length of the instrument and it's uneven resonances. Little Jake works well but alters the sound. It needs a direct box of some kind.
</p>

<p>
The bocal can sometimes add sounds of breathing, bocal condensation, finger noieses, etc.
</p>
</div>
</div>
<div id="outline-container-org047e662" class="outline-3">
<h3 id="org047e662">Microphones&#xa0;&#xa0;&#xa0;<span class="tag"><span class="amp">amp</span></span></h3>
<div class="outline-text-3" id="text-org047e662">
<p>
Mics sound more natural but add to the setup difficulties. They often restrict movement and can have feedback issues. Some use lapel microphones.
</p>
</div>
</div>
<div id="outline-container-org42643d7" class="outline-3">
<h3 id="org42643d7">Sitting or standing&#xa0;&#xa0;&#xa0;<span class="tag"><span class="difficulty">difficulty</span></span></h3>
<div class="outline-text-3" id="text-org42643d7">
<p>
The choice to sit or stand when there are pedals can be a hard one. It requires practice
</p>
</div>
</div>
<div id="outline-container-org0d99a00" class="outline-3">
<h3 id="org0d99a00">Responsibility&#xa0;&#xa0;&#xa0;<span class="tag"><span class="quote">quote</span></span></h3>
<div class="outline-text-3" id="text-org0d99a00">
<p>
Rachel Yoder's diss has a quote saying the composer creates and environment and gives freedom to the performer. But the performer then has more responsibility for the end result.
</p>
</div>
</div>
<div id="outline-container-org452169a" class="outline-3">
<h3 id="org452169a">Co composer</h3>
<div class="outline-text-3" id="text-org452169a">
<p>
Describes how she became part of the composition process in Ripped Up Maps
</p>
</div>
</div>
<div id="outline-container-org1c4c4d8" class="outline-3">
<h3 id="org1c4c4d8">Pitch Tracking&#xa0;&#xa0;&#xa0;<span class="tag"><span class="difficulty">difficulty</span></span></h3>
<div class="outline-text-3" id="text-org1c4c4d8">
<p>
Pitch tracking is difficult on the bassoon, as resonances can throw things off. One mic can't properly capture the sound (perhaps a pickup can help this)
</p>
</div>
</div>
<div id="outline-container-org9da9035" class="outline-3">
<h3 id="org9da9035">Score Following</h3>
<div class="outline-text-3" id="text-org9da9035">
<p>
On the oboe lots of things can cause a pitch trigger not to trigger. It is possible because of the tone, timbre, and articulation of double reeds that this is worse than with other instruments.
</p>
</div>
</div>
<div id="outline-container-orgc4675c4" class="outline-3">
<h3 id="orgc4675c4">Sand Daemon</h3>
<div class="outline-text-3" id="text-orgc4675c4">
<p>
Some clues of setup for piece.  A 4-channel midi pedal (surely not 4 channels but 4 signals?) Difficult to push buttons and play at the right time
</p>
</div>
</div>
<div id="outline-container-org92b9abc" class="outline-3">
<h3 id="org92b9abc">Technicians</h3>
<div class="outline-text-3" id="text-org92b9abc">
<p>
In some venues it may not be feasible that the technician can read music to advance a patch. A foot pedal can help be more confident in a traveling performance.
</p>
</div>
</div>
<div id="outline-container-orgfff43a5" class="outline-3">
<h3 id="orgfff43a5">Benefit of Live Composers</h3>
<div class="outline-text-3" id="text-orgfff43a5">
<p>
A benefit of playing these pieces is that often composers are still alive and can answer questions about what they wrote
</p>
</div>
</div>
<div id="outline-container-org3f42ead" class="outline-3">
<h3 id="org3f42ead">composer interviews</h3>
<div class="outline-text-3" id="text-org3f42ead">
<p>
start here
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p><a href="sitemap.html">Site Map</a></p>
</div>
</body>
</html>
